<h1 align="center">Test Task №1</h1>

## Оглавление:
1. [Класс Scalculator](#Класс-Scalculator)
2. [Класс Type](#Класс-Type)
3. [Персонализация](#Персонализация)

## Класс Scalculator

Данный класс является сборником формул, для соответствующих подсчетов. Единственное поле данного класса - это ответ, оно сделано для удобства. Однако совершенно не обязательно. 
Далее следуют два необходимых по условию метода, в которых расчитываются площади треугольника и круга соответственно:

```
public void Trl_rib( double a, double b, double c ){ ... }
```

```
public void Crl_r( double r ){ ... }
```

## Класс Type

Данный класс является звеном, позволяющим пользователю не определять тип фигуры заранее во входных данных. Программа сама определяет тип фигуры в run-time при помощи заданных правил. Более наглядно используемый принцип можно рассмотреть на примере ниже:

```
var info = Console.ReadLine();
Type figure = Type.check(info);
switch (Type.ToLower())
{
    case "square": 
        { ... }; break;
    case "rectangle":  
        { ... }; break;
    case "circle": 
        { ... }; break;
    default:  
        Console.WriteLine("Неверный тип фигуры"); break;
}
```

Таким образом, в зависимости от количества введенных чисел зависит тип рассматриваемой фигуры. В случае, если рассмотриваему количеству введенных данных сопоставляется одна из фигур, данные проверяются на истинност 

<b>*Example:*</b> Проверка существвования треугольника по трем сторонам.

Если же количеству данных сопоставляется несколько типов фигур - данные проходят дополнительные проверки для более точного определения:

<b>*Example:*</b> Является треугольник прямоугольным.

## Персонализация

Исходя из технического задания, необходимо было написать программу, в которую можно будет легко добавлять новые фигуры. Для этого необходимо создать новый метод для рассчета площади в классе <b>Scalculator</b>, а также инициализацию данной фигуры в классе <b>Type</b>. Метод <b>*Type.Check( data[ ] )*</b> возвращаетчисло, которое соответствует той или иной фигуре, однако можно сделать метод строковым и возвращать *string* - название самой фигуры, как было показано в примере. Принцип работы программы подобные подобные коррективы не меняют.
